{
    "option.ebe.config": "Blocchi Entità...",

    "value.ebe.true": "Acceso",
    "value.ebe.false": "Spento",
    "value.ebe.allowed": "Permesso",
    "value.ebe.forced": "Forzato",
    "value.ebe.disabled": "Disabilitato",
    "value.ebe.smart": "Intelligente",
    "value.ebe.all": "Tutti",
    "value.ebe.most": "Molti",
    "value.ebe.some": "Alcuni",
    "value.ebe.few": "Pochi",

    "option.ebe.render_enhanced_chests": "Casse Avanzate",
    "option.ebe.render_enhanced_chests.comment": "Abilita modelli di casse avanzati, migliorando notevolmente le prestazioni in aree con molte casse. Permette anche di vedere le casse da lontano. Disabilita se le casse appaiono invisibili a causa di un altro mod.",
    "option.ebe.render_enhanced_signs": "Cartelli Avanzati",
    "option.ebe.render_enhanced_signs.comment": "Abilita modelli di cartelli avanzati e rendering intelligente del testo, migliorando notevolmente le prestazioni in aree con molti cartelli. Permette anche di vedere i cartelli da lontano. Disabilita se i cartelli appaiono invisibili a causa di un altro mod.",
    "option.ebe.render_enhanced_bells": "Campane Avanzate",
    "option.ebe.render_enhanced_bells.comment": "Abilita modelli di campane avanzati, migliorando notevolmente le prestazioni in aree con molte campane. Permette anche di vedere le campane da lontano. Disabilita se le campane appaiono invisibili a causa di un altro mod.",
    "option.ebe.render_enhanced_beds": "Letti Avanzati",
    "option.ebe.render_enhanced_beds.comment": "Abilita modelli di letti avanzati, migliorando notevolmente le prestazioni in aree con molti letti. Permette anche di vedere i letti da lontano. Disabilita se i letti appaiono invisibili a causa di un altro mod.",
    "option.ebe.render_enhanced_shulker_boxes": "Shulker Box Avanzati",
    "option.ebe.render_enhanced_shulker_boxes.comment": "Abilita modelli di shulker box avanzati, migliorando notevolmente le prestazioni in aree con molti shulker box. Permette anche di vedere gli shulker box da lontano. Disabilita se gli shulker box appaiono invisibili a causa di un altro mod.",
    "option.ebe.render_enhanced_decorated_pots": "Vasi Decorati Avanzati",
    "option.ebe.render_enhanced_decorated_pots.comment": "Abilita modelli di vasi decorati avanzati, migliorando notevolmente le prestazioni in aree con molti vasi decorati. Permette anche di vedere i vasi decorati da lontano. Disabilita se i vasi decorati appaiono invisibili o se i motivi delle ceramiche modificate non funzionano correttamente.",
    "option.ebe.chest_ao": "Illuminazione Casse Uniforme",
    "option.ebe.chest_ao.comment": "Permette alle casse di utilizzare l'illuminazione uniforme e l'occlusione ambientale. Richiede che le Casse Avanzate siano abilitate.",
    "option.ebe.sign_ao": "Illuminazione Cartelli Uniforme",
    "option.ebe.sign_ao.comment": "Permette ai cartelli di utilizzare l'illuminazione uniforme e l'occlusione ambientale. Richiede che i Cartelli Avanzati siano abilitati.",
    "option.ebe.bell_ao": "Illuminazione Campane Uniforme",
    "option.ebe.bell_ao.comment": "Permette alle campane di utilizzare l'illuminazione uniforme e l'occlusione ambientale. Richiede che le Campane Avanzate siano abilitate.",
    "option.ebe.bed_ao": "Illuminazione Letti Uniforme",
    "option.ebe.bed_ao.comment": "Permette ai letti di utilizzare l'illuminazione uniforme e l'occlusione ambientale. Richiede che i Letti Avanzati siano abilitati.",
    "option.ebe.shulker_box_ao": "Illuminazione Shulker Box Uniforme",
    "option.ebe.shulker_box_ao.comment": "Permette agli shulker box di utilizzare l'illuminazione uniforme e l'occlusione ambientale. Richiede che gli Shulker Box Avanzati siano abilitati.",
    "option.ebe.decorated_pot_ao": "Illuminazione Vasi Decorati Uniforme",
    "option.ebe.decorated_pot_ao.comment": "Permette ai vasi decorati di utilizzare l'illuminazione uniforme e l'occlusione ambientale. Richiede che i Vasi Decorati Avanzati siano abilitati.",
    "option.ebe.christmas_chests": "Casse di Natale",
    "option.ebe.christmas_chests.valueComment.allowed": "Permesso - La texture natalizia verrà applicata dal 24 al 26 dicembre.",
    "option.ebe.christmas_chests.valueComment.forced": "Forzato - La texture natalizia verrà sempre applicata.",
    "option.ebe.christmas_chests.valueComment.disabled": "Disabilitato - La texture natalizia non verrà mai applicata.",
    "option.ebe.christmas_chests.comment": "Permette, forza o disabilita la texture natalizia delle casse. Richiede che le Casse Avanzate siano abilitate.",
    "option.ebe.sign_text_rendering": "Rendering Testo Cartelli",
    "option.ebe.sign_text_rendering.valueComment.smart": "Intelligente - La distanza massima di rendering verrà determinata automaticamente in base a quanti cartelli vengono renderizzati contemporaneamente.",
    "option.ebe.sign_text_rendering.valueComment.all": "Tutti - Tutti i cartelli entro la distanza di rendering dell'entità blocco proveranno a renderizzare il testo. Molto pesante per le prestazioni.",
    "option.ebe.sign_text_rendering.valueComment.most": "Molti - Tutti i cartelli entro il 50% della distanza di rendering dell'entità blocco proveranno a renderizzare il testo.",
    "option.ebe.sign_text_rendering.valueComment.some": "Alcuni - Tutti i cartelli entro il 30% della distanza di rendering dell'entità blocco proveranno a renderizzare il testo.",
    "option.ebe.sign_text_rendering.valueComment.few": "Pochi - Tutti i cartelli entro il 20% della distanza di rendering dell'entità blocco proveranno a renderizzare il testo. Migliori prestazioni.",
    "option.ebe.sign_text_rendering.comment": "Determina la distanza massima dal giocatore alla quale il testo dei cartelli verrà renderizzato. Richiede che i Cartelli Avanzati siano abilitati.",
    "option.ebe.experimental_chests": "Casse Sperimentali",
    "option.ebe.experimental_chests.comment": "Abilita funzioni di rendering molto sperimentali per le casse, come texture di particelle generate appositamente che funzionano con i pacchetti di risorse.",
    "option.ebe.experimental_beds": "Letti Sperimentali",
    "option.ebe.experimental_beds.comment": "Abilita funzioni di rendering molto sperimentali per i letti, come texture di particelle generate appositamente che funzionano con i pacchetti di risorse.",
    "option.ebe.experimental_signs": "Cartelli Sperimentali",
    "option.ebe.experimental_signs.comment": "Abilita funzioni di rendering molto sperimentali per i cartelli, come texture di particelle generate appositamente che funzionano con i pacchetti di risorse.",
    "option.ebe.force_resource_pack_compat": "Forza Compatibilità Pacchetto di Risorse",
    "option.ebe.force_resource_pack_compat.comment": "Abilita questa opzione se i blocchi sono invisibili quando si utilizzano i pacchetti di risorse. Non usare con pacchetti di risorse progettati per questo mod. Se i problemi persistono, segnalali.",
    "option.ebe.dump": "Esporta Risorse di Esempio",
    "option.ebe.dump.comment": "Esporta le risorse predefinite del mod in .minecraft/enhanced_bes_dump/ da utilizzare come esempio per i creatori di pacchetti di risorse.",

    "screen.ebe.config": "Impostazioni Entità Blocchi",

    "text.ebe.apply": "Applica",
    "text.ebe.descriptions": "Passa sopra le opzioni per le descrizioni",
    "text.ebe.chest_options": "Opzioni Casse",
    "text.ebe.sign_options": "Opzioni Cartelli",
    "text.ebe.bell_options": "Opzioni Campane",
    "text.ebe.bed_options": "Opzioni Letti",
    "text.ebe.shulker_box_options": "Opzioni Shulker Box",
    "text.ebe.decorated_pot_options": "Opzioni Vasi Decorati",
    "text.ebe.advanced": "Avanzato",
    "text.ebe.option_value_division": ": "
}
